test/siege-test-results.txt
siege -c 5 -r1000 'http://localhost:85/MongoSession/test.php?s=test3'

[FILES] - 100% OK for currency. 

** SIEGE 2.68
** Preparing 5 concurrent users for battle.
The server is now under siege..      done.
Transactions:		        5000 hits
Availability:		      100.00 %
Elapsed time:		        5.71 secs
Data transferred:	        0.02 MB
Response time:		        0.01 secs
Transaction rate:	      875.66 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        4.96
Successful transactions:        5000
Failed transactions:	           0
Longest transaction:	        1.37
Shortest transaction:	        0.00
 
[MEMCACHE] - 100% concurrency OK
** SIEGE 2.68
** Preparing 5 concurrent users for battle.
The server is now under siege..      done.
Transactions:		        5000 hits
Availability:		      100.00 %
Elapsed time:		        5.56 secs
Data transferred:	        0.02 MB
Response time:		        0.01 secs
Transaction rate:	      899.28 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        4.58
Successful transactions:        5000
Failed transactions:	           0
Longest transaction:	        0.78
Shortest transaction:	        0.00

[MONGO - safe = false] - result: 2514 (wrong, should be 5000)
** SIEGE 2.68
** Preparing 5 concurrent users for battle.
The server is now under siege..      done.
Transactions:		        5000 hits
Availability:		      100.00 %
Elapsed time:		        6.92 secs
Data transferred:	        0.02 MB
Response time:		        0.01 secs
Transaction rate:	      722.54 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        4.95
Successful transactions:        5000
Failed transactions:	           0
Longest transaction:	        0.58
Shortest transaction:	        0.00


[MONGO - safe = true] - result: 2807 (wrong, should be 5000)

** SIEGE 2.68
** Preparing 5 concurrent users for battle.
The server is now under siege..      done.
Transactions:		        5000 hits
Availability:		      100.00 %
Elapsed time:		        5.91 secs
Data transferred:	        0.02 MB
Response time:		        0.01 secs
Transaction rate:	      846.02 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        4.94
Successful transactions:        5000
Failed transactions:	           0
Longest transaction:	        0.11
Shortest transaction:	        0.00